NetologySlow/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NetologySlow/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

NetologySlow/src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

NetologySlow/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

NetologySlow/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

NetologySlow/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

NetologySlow/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41. </code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>50. </code>
    </items>
    <items>
      <name>РассчетыСПоставщиками</name>
      <description>Рассчеты с поставщиками</description>
      <code>60. </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РассчетыСПокупателями</name>
      <description>Рассчеты с покупателями</description>
      <code>62. </code>
    </items>
    <items>
      <name>РассчетыССотрудниками</name>
      <description>Рассчеты с сотрудниками</description>
      <code>70. </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90. </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Расходы</name>
        <description>Расходы</description>
        <code>90.2</code>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

NetologySlow/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Контрагенты</types>
  </type>
  <predefined>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

NetologySlow/src/Documents/ПоступлениеТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  
	
	Ответственный=ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// сохранять в реквизит шапки Сумма итог по одноименному реквизиту табличной части для отображения в списках
	// Посмотреть в Документах по ДЗ     
	Сумма = ТоварыИУслуги.Итог("СуммаСНДС");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)    
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СУММА(ПоступлениеТоваровИУслугТоварыИУслуги.Количество) КАК Количество,
	                    |	СУММА(ПоступлениеТоваровИУслугТоварыИУслуги.Цена) КАК Цена,
	                    |	СУММА(ПоступлениеТоваровИУслугТоварыИУслуги.СуммаСНДС) КАК СуммаСНДС,
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура.Тип КАК Тип
	                    |ИЗ
	                    |	Документ.ПоступлениеТоваровИУслуг.ТоварыИУслуги КАК ПоступлениеТоваровИУслугТоварыИУслуги
	                    |ГДЕ
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура,
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура.Тип"); 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Результат=Запрос.Выполнить().Выгрузить();     
	
	Движения.Товары.Записывать = Истина;
	Движения.Расходы.Записывать = Истина; 
	Движения.Управленческий.Очистить();  
	Движения.Управленческий.Записывать=Истина;
	
	Для Каждого Строка Из Результат Цикл    // регистр Товары Приход
		
		Если Строка.Тип=Перечисления.ТипыНоменклатуры.Товар Тогда
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.Количество = Строка.Количество;    
			Движение.Сумма = Строка.СуммаСНДС; 
			
			// регистр Управленческий     Дт41 Товары - Кт60 Рассчеты с поставщиками   
			Проводка=Движения.Управленческий.Добавить(); 
			Проводка.Период=Дата; 
			Проводка.СчетДт=ПланыСчетов.Управленческий.Товары;   
			Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура]
			=Строка.Номенклатура; 
			Проводка.СчетКт=ПланыСчетов.Управленческий.РассчетыСПоставщиками; 
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты]
			=Поставщик;
			Проводка.Сумма=Строка.СуммаСНДС;  
			Проводка.Количество = Строка.Количество; 
			
		ИначеЕсли Строка.Тип=Перечисления.ТипыНоменклатуры.Услуга Тогда  // регистр Расходы 
			Движение = Движения.Расходы.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.Сумма = Строка.СуммаСНДС;  
			
			Проводка=Движения.Управленческий.Добавить(); 
			Проводка.Период=Дата;  
			
			Проводка.СчетДт=ПланыСчетов.Управленческий.Расходы;   
			Проводка.СчетКт=ПланыСчетов.Управленческий.РассчетыСПоставщиками; 
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты]
			=Поставщик;
			Проводка.Сумма=Строка.СуммаСНДС;
			
		КонецЕсли; 
	КонецЦикла;     
	
	// регистр ВзаиморасчетыСКонтрагентами Расход
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Поставщик;
	Движение.Сумма = Сумма;
	
КонецПроцедуры
